# Rebar Constraints Manager Methods

Source: https://www.revitapidocs.com/2026/c0ea35cf-f8da-bee5-9264-82473ed37d0c.htm

---

| Rebar Constraints Manager Methods |
| --- |

The RebarConstraintsManager type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | AllowConstraintTargets |  |
|  | ApplyRebarConstraints |  |
|  | ClearHandleConstraintPairHighlighting | Clears all highlighting in all views. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetAllConstrainedHandles | Retrieves all handles on the Rebar that are constrained to external references. |
|  | GetAllHandles | Gets all RebarConstrainedHandles of this bar. |
|  | GetConstraintCandidatesForHandle(RebarConstrainedHandle, ElementId) | For shape driven rebar returns all possible RebarConstraints belonging to references from the provided element that could be used for a specified RebarConstrainedHandle. For free form rebar will return an empty list. |
|  | GetConstraintCandidatesForHandle(RebarConstrainedHandle, Reference) | For shape driven rebar returns all possible RebarConstraints that will constrain RebarConstrainedHandle to the provided reference. For free form rebar will return an empty list. |
|  | GetCurrentConstraintOnHandle | Retrieves the RebarConstraint that acts on the specified RebarConstraintHandle. |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetPreferredConstraintOnHandle | For ShapeDriven: Returns the RebarConstraint that has been set as preferred for the specified RebarConstrainedHandle. For FreeForm: Returns the RebarConstraint that acts on the specified RebarConstraintHandle. |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | HasValidRebar | Checks whether the Manager's Rebar is still valid. |
|  | HighlightHandleConstraintPairInAllViews | Highlights the specified RebarConstrainedHandle and RebarConstraint in all views. |
|  | RemovePreferredConstraintFromHandle | For ShapeDriven: Clears the user\-preferred RebarConstraint from the specified RebarConstrainedHandle. For FreeForm: Removes the RebarConstraint that is associated to the specified RebarConstrainedHandle. |
|  | SetPreferredConstraint | Sets the RebarConstraint as preferred constraint for its RebarConstrainedHandle. |
|  | SetPreferredConstraintsToSurfaceForHandles |  |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

RebarConstraintsManager Class Autodesk.Revit.DB.Structure Namespace